diagrams/d2/decomp/ch02-0.d2
direction: down

R: {
  label: |md
    **the client**
  |
  shape: rectangle
  style: {
    fill: "#238636"
    stroke: "#2ea043"
    font-color: "#FFFFFF"
    border-radius: 8
    font-size: 16
  }
}

P0: {
  label: |md
    sends a request to the API gateway
  |
  shape: rectangle
  style: {
    fill: "#1f6feb"
    stroke: "#388bfd"
    font-color: "#FFFFFF"
    border-radius: 6
    font-size: 15
  }
}

P1: {
  label: |md
    reads the composed response
  |
  shape: rectangle
  style: {
    fill: "#1f6feb"
    stroke: "#388bfd"
    font-color: "#FFFFFF"
    border-radius: 6
    font-size: 15
  }
}

R -> P0: "1. comprises"
R -> P1: "2. comprises"
